## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 16 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                |
|----------|--------------------------------------------------------------------|
| update   | `aws_eks_addon.coredns`                                            |
|          | `aws_eks_addon.ebs_driver`                                         |
|          | `aws_eks_addon.kube_proxy`                                         |
|          | `aws_eks_addon.vpc_cni`                                            |
|          | `aws_eks_cluster.notification-canada-ca-eks-cluster`               |
|          | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`     |
|          | `aws_iam_openid_connect_provider.notification-canada-ca`           |
|          | `aws_iam_role.admin`                                               |
|          | `aws_iam_role.api`                                                 |
|          | `aws_iam_role.celery`                                              |
|          | `aws_iam_role.document_download`                                   |
|          | `aws_iam_role.notification-service-account-role`                   |
|          | `aws_iam_role.secrets_csi_blazer`                                  |
|          | `aws_iam_role.secrets_csi_nginx`                                   |
|          | `module.iam_assumable_role_karpenter.aws_iam_role.this[0]`         |
|          | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`           |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/14839221313).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
14:54:22.508 STDOUT terraform:   ~ update in-place
14:54:22.508 STDOUT terraform: -/+ destroy and then create replacement
14:54:22.508 STDOUT terraform:  <= read (data resources)
14:54:22.508 STDOUT terraform: Terraform will perform the following actions:
14:54:22.508 STDOUT terraform:   # data.aws_eks_cluster.notify_cluster will be read during apply
14:54:22.508 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.508 STDOUT terraform:  <= data "aws_eks_cluster" "notify_cluster" {
14:54:22.508 STDOUT terraform:       + access_config             = (known after apply)
14:54:22.508 STDOUT terraform:       + arn                       = (known after apply)
14:54:22.508 STDOUT terraform:       + certificate_authority     = (known after apply)
14:54:22.508 STDOUT terraform:       + cluster_id                = (known after apply)
14:54:22.508 STDOUT terraform:       + compute_config            = (known after apply)
14:54:22.508 STDOUT terraform:       + created_at                = (known after apply)
14:54:22.508 STDOUT terraform:       + enabled_cluster_log_types = (known after apply)
14:54:22.508 STDOUT terraform:       + endpoint                  = (known after apply)
14:54:22.508 STDOUT terraform:       + id                        = (known after apply)
14:54:22.508 STDOUT terraform:       + identity                  = (known after apply)
14:54:22.508 STDOUT terraform:       + kubernetes_network_config = (known after apply)
14:54:22.508 STDOUT terraform:       + name                      = "notification-canada-ca-production-eks-cluster"
14:54:22.508 STDOUT terraform:       + outpost_config            = (known after apply)
14:54:22.508 STDOUT terraform:       + platform_version          = (known after apply)
14:54:22.508 STDOUT terraform:       + remote_network_config     = (known after apply)
14:54:22.508 STDOUT terraform:       + role_arn                  = (known after apply)
14:54:22.508 STDOUT terraform:       + status                    = (known after apply)
14:54:22.508 STDOUT terraform:       + storage_config            = (known after apply)
14:54:22.508 STDOUT terraform:       + tags                      = (known after apply)
14:54:22.508 STDOUT terraform:       + upgrade_policy            = (known after apply)
14:54:22.509 STDOUT terraform:       + version                   = (known after apply)
14:54:22.509 STDOUT terraform:       + vpc_config                = (known after apply)
14:54:22.509 STDOUT terraform:       + zonal_shift_config        = (known after apply)
14:54:22.509 STDOUT terraform:     }
14:54:22.509 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_admin will be read during apply
14:54:22.509 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.509 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_admin" {
14:54:22.509 STDOUT terraform:       + id            = (known after apply)
14:54:22.509 STDOUT terraform:       + json          = (known after apply)
14:54:22.509 STDOUT terraform:       + minified_json = (known after apply)
14:54:22.509 STDOUT terraform:       + statement {
14:54:22.509 STDOUT terraform:           + actions = [
14:54:22.509 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
14:54:22.509 STDOUT terraform:             ]
14:54:22.509 STDOUT terraform:           + effect  = "Allow"
14:54:22.509 STDOUT terraform:           + condition {
14:54:22.509 STDOUT terraform:               + test     = "StringEquals"
14:54:22.509 STDOUT terraform:               + values   = [
14:54:22.509 STDOUT terraform:                   + "sts.amazonaws.com",
14:54:22.509 STDOUT terraform:                 ]
14:54:22.509 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
14:54:22.509 STDOUT terraform:             }
14:54:22.509 STDOUT terraform:           + condition {
14:54:22.509 STDOUT terraform:               + test     = "StringEquals"
14:54:22.509 STDOUT terraform:               + values   = [
14:54:22.509 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-admin",
14:54:22.509 STDOUT terraform:                 ]
14:54:22.509 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
14:54:22.509 STDOUT terraform:             }
14:54:22.509 STDOUT terraform:           + principals {
14:54:22.509 STDOUT terraform:               + identifiers = [
14:54:22.510 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
14:54:22.510 STDOUT terraform:                 ]
14:54:22.510 STDOUT terraform:               + type        = "Federated"
14:54:22.510 STDOUT terraform:             }
14:54:22.510 STDOUT terraform:         }
14:54:22.510 STDOUT terraform:     }
14:54:22.510 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_api will be read during apply
14:54:22.510 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.510 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_api" {
14:54:22.510 STDOUT terraform:       + id            = (known after apply)
14:54:22.510 STDOUT terraform:       + json          = (known after apply)
14:54:22.510 STDOUT terraform:       + minified_json = (known after apply)
14:54:22.510 STDOUT terraform:       + statement {
14:54:22.510 STDOUT terraform:           + actions = [
14:54:22.510 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
14:54:22.510 STDOUT terraform:             ]
14:54:22.510 STDOUT terraform:           + effect  = "Allow"
14:54:22.510 STDOUT terraform:           + condition {
14:54:22.510 STDOUT terraform:               + test     = "StringEquals"
14:54:22.510 STDOUT terraform:               + values   = [
14:54:22.510 STDOUT terraform:                   + "sts.amazonaws.com",
14:54:22.510 STDOUT terraform:                 ]
14:54:22.510 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
14:54:22.510 STDOUT terraform:             }
14:54:22.510 STDOUT terraform:           + condition {
14:54:22.510 STDOUT terraform:               + test     = "StringEquals"
14:54:22.510 STDOUT terraform:               + values   = [
14:54:22.510 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-api",
14:54:22.510 STDOUT terraform:                 ]
14:54:22.510 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
14:54:22.514 STDOUT terraform:             }
14:54:22.514 STDOUT terraform:           + principals {
14:54:22.514 STDOUT terraform:               + identifiers = [
14:54:22.514 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
14:54:22.514 STDOUT terraform:                 ]
14:54:22.514 STDOUT terraform:               + type        = "Federated"
14:54:22.514 STDOUT terraform:             }
14:54:22.514 STDOUT terraform:         }
14:54:22.514 STDOUT terraform:     }
14:54:22.514 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_celery will be read during apply
14:54:22.514 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.514 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_celery" {
14:54:22.514 STDOUT terraform:       + id            = (known after apply)
14:54:22.514 STDOUT terraform:       + json          = (known after apply)
14:54:22.514 STDOUT terraform:       + minified_json = (known after apply)
14:54:22.514 STDOUT terraform:       + statement {
14:54:22.514 STDOUT terraform:           + actions = [
14:54:22.514 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
14:54:22.514 STDOUT terraform:             ]
14:54:22.514 STDOUT terraform:           + effect  = "Allow"
14:54:22.514 STDOUT terraform:           + condition {
14:54:22.514 STDOUT terraform:               + test     = "StringEquals"
14:54:22.515 STDOUT terraform:               + values   = [
14:54:22.515 STDOUT terraform:                   + "sts.amazonaws.com",
14:54:22.515 STDOUT terraform:                 ]
14:54:22.515 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
14:54:22.515 STDOUT terraform:             }
14:54:22.515 STDOUT terraform:           + condition {
14:54:22.515 STDOUT terraform:               + test     = "StringEquals"
14:54:22.515 STDOUT terraform:               + values   = [
14:54:22.515 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-celery",
14:54:22.515 STDOUT terraform:                 ]
14:54:22.516 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
14:54:22.516 STDOUT terraform:             }
14:54:22.516 STDOUT terraform:           + principals {
14:54:22.516 STDOUT terraform:               + identifiers = [
14:54:22.516 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
14:54:22.516 STDOUT terraform:                 ]
14:54:22.516 STDOUT terraform:               + type        = "Federated"
14:54:22.516 STDOUT terraform:             }
14:54:22.516 STDOUT terraform:         }
14:54:22.517 STDOUT terraform:     }
14:54:22.517 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_document_download will be read during apply
14:54:22.517 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.517 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_document_download" {
14:54:22.517 STDOUT terraform:       + id            = (known after apply)
14:54:22.517 STDOUT terraform:       + json          = (known after apply)
14:54:22.517 STDOUT terraform:       + minified_json = (known after apply)
14:54:22.517 STDOUT terraform:       + statement {
14:54:22.517 STDOUT terraform:           + actions = [
14:54:22.518 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
14:54:22.518 STDOUT terraform:             ]
14:54:22.518 STDOUT terraform:           + effect  = "Allow"
14:54:22.518 STDOUT terraform:           + condition {
14:54:22.518 STDOUT terraform:               + test     = "StringEquals"
14:54:22.518 STDOUT terraform:               + values   = [
14:54:22.518 STDOUT terraform:                   + "sts.amazonaws.com",
14:54:22.518 STDOUT terraform:                 ]
14:54:22.518 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
14:54:22.518 STDOUT terraform:             }
14:54:22.518 STDOUT terraform:           + condition {
14:54:22.518 STDOUT terraform:               + test     = "StringEquals"
14:54:22.518 STDOUT terraform:               + values   = [
14:54:22.518 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-document-download",
14:54:22.518 STDOUT terraform:                 ]
14:54:22.518 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
14:54:22.519 STDOUT terraform:             }
14:54:22.519 STDOUT terraform:           + principals {
14:54:22.519 STDOUT terraform:               + identifiers = [
14:54:22.519 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
14:54:22.519 STDOUT terraform:                 ]
14:54:22.519 STDOUT terraform:               + type        = "Federated"
14:54:22.519 STDOUT terraform:             }
14:54:22.520 STDOUT terraform:         }
14:54:22.520 STDOUT terraform:     }
14:54:22.520 STDOUT terraform:   # data.aws_iam_policy_document.eks-assume-role-policy will be read during apply
14:54:22.520 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.520 STDOUT terraform:  <= data "aws_iam_policy_document" "eks-assume-role-policy" {
14:54:22.520 STDOUT terraform:       + id            = (known after apply)
14:54:22.520 STDOUT terraform:       + json          = (known after apply)
14:54:22.520 STDOUT terraform:       + minified_json = (known after apply)
14:54:22.520 STDOUT terraform:       + statement {
14:54:22.520 STDOUT terraform:           + actions = [
14:54:22.520 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
14:54:22.521 STDOUT terraform:             ]
14:54:22.521 STDOUT terraform:           + effect  = "Allow"
14:54:22.521 STDOUT terraform:           + condition {
14:54:22.521 STDOUT terraform:               + test     = "StringEquals"
14:54:22.521 STDOUT terraform:               + values   = [
14:54:22.521 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notification-service-account",
14:54:22.521 STDOUT terraform:                 ]
14:54:22.521 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
14:54:22.521 STDOUT terraform:             }
14:54:22.521 STDOUT terraform:           + principals {
14:54:22.521 STDOUT terraform:               + identifiers = [
14:54:22.521 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
14:54:22.521 STDOUT terraform:                 ]
14:54:22.521 STDOUT terraform:               + type        = "Federated"
14:54:22.521 STDOUT terraform:             }
14:54:22.521 STDOUT terraform:         }
14:54:22.521 STDOUT terraform:     }
14:54:22.521 STDOUT terraform:   # data.aws_iam_policy_document.secrets_csi_assume_role_policy_blazer will be read during apply
14:54:22.521 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.521 STDOUT terraform:  <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_blazer" {
14:54:22.521 STDOUT terraform:       + id            = (known after apply)
14:54:22.521 STDOUT terraform:       + json          = (known after apply)
14:54:22.521 STDOUT terraform:       + minified_json = (known after apply)
14:54:22.521 STDOUT terraform:       + statement {
14:54:22.521 STDOUT terraform:           + actions = [
14:54:22.521 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
14:54:22.521 STDOUT terraform:             ]
14:54:22.521 STDOUT terraform:           + effect  = "Allow"
14:54:22.521 STDOUT terraform:           + condition {
14:54:22.521 STDOUT terraform:               + test     = "StringEquals"
14:54:22.521 STDOUT terraform:               + values   = [
14:54:22.521 STDOUT terraform:                   + "sts.amazonaws.com",
14:54:22.522 STDOUT terraform:                 ]
14:54:22.522 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
14:54:22.522 STDOUT terraform:             }
14:54:22.522 STDOUT terraform:           + condition {
14:54:22.522 STDOUT terraform:               + test     = "StringEquals"
14:54:22.522 STDOUT terraform:               + values   = [
14:54:22.522 STDOUT terraform:                   + "system:serviceaccount:tools:blazer",
14:54:22.522 STDOUT terraform:                 ]
14:54:22.522 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
14:54:22.522 STDOUT terraform:             }
14:54:22.522 STDOUT terraform:           + principals {
14:54:22.522 STDOUT terraform:               + identifiers = [
14:54:22.522 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
14:54:22.522 STDOUT terraform:                 ]
14:54:22.522 STDOUT terraform:               + type        = "Federated"
14:54:22.522 STDOUT terraform:             }
14:54:22.522 STDOUT terraform:         }
14:54:22.522 STDOUT terraform:     }
14:54:22.522 STDOUT terraform:   # data.aws_iam_policy_document.secrets_csi_assume_role_policy_nginx will be read during apply
14:54:22.522 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.522 STDOUT terraform:  <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_nginx" {
14:54:22.522 STDOUT terraform:       + id            = (known after apply)
14:54:22.522 STDOUT terraform:       + json          = (known after apply)
14:54:22.522 STDOUT terraform:       + minified_json = (known after apply)
14:54:22.522 STDOUT terraform:       + statement {
14:54:22.522 STDOUT terraform:           + actions = [
14:54:22.522 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
14:54:22.525 STDOUT terraform:             ]
14:54:22.525 STDOUT terraform:           + effect  = "Allow"
14:54:22.525 STDOUT terraform:           + condition {
14:54:22.525 STDOUT terraform:               + test     = "StringEquals"
14:54:22.526 STDOUT terraform:               + values   = [
14:54:22.526 STDOUT terraform:                   + "sts.amazonaws.com",
14:54:22.526 STDOUT terraform:                 ]
14:54:22.526 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
14:54:22.526 STDOUT terraform:             }
14:54:22.526 STDOUT terraform:           + condition {
14:54:22.526 STDOUT terraform:               + test     = "StringEquals"
14:54:22.526 STDOUT terraform:               + values   = [
14:54:22.526 STDOUT terraform:                   + "system:serviceaccount:nginx:ingress-nginx-ingress",
14:54:22.526 STDOUT terraform:                 ]
14:54:22.526 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
14:54:22.526 STDOUT terraform:             }
14:54:22.526 STDOUT terraform:           + principals {
14:54:22.526 STDOUT terraform:               + identifiers = [
14:54:22.526 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
14:54:22.526 STDOUT terraform:                 ]
14:54:22.526 STDOUT terraform:               + type        = "Federated"
14:54:22.526 STDOUT terraform:             }
14:54:22.526 STDOUT terraform:         }
14:54:22.526 STDOUT terraform:     }
14:54:22.526 STDOUT terraform:   # data.aws_security_group.eks-securitygroup-rds will be read during apply
14:54:22.526 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.526 STDOUT terraform:  <= data "aws_security_group" "eks-securitygroup-rds" {
14:54:22.526 STDOUT terraform:       + arn         = (known after apply)
14:54:22.526 STDOUT terraform:       + description = (known after apply)
14:54:22.526 STDOUT terraform:       + id          = "sg-09e3175f46bc85607"
14:54:22.526 STDOUT terraform:       + name        = (known after apply)
14:54:22.526 STDOUT terraform:       + tags        = (known after apply)
14:54:22.526 STDOUT terraform:       + vpc_id      = (known after apply)
14:54:22.526 STDOUT terraform:     }
14:54:22.526 STDOUT terraform:   # data.tls_certificate.notification-canada-ca will be read during apply
14:54:22.526 STDOUT terraform:   # (depends on a resource or a module with changes pending)
14:54:22.527 STDOUT terraform:  <= data "tls_certificate" "notification-canada-ca" {
14:54:22.527 STDOUT terraform:       + certificates = (known after apply)
14:54:22.527 STDOUT terraform:       + id           = (known after apply)
14:54:22.527 STDOUT terraform:       + url          = "https://oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
14:54:22.527 STDOUT terraform:     }
14:54:22.527 STDOUT terraform:   # aws_eks_addon.coredns will be updated in-place
14:54:22.527 STDOUT terraform:   ~ resource "aws_eks_addon" "coredns" {
14:54:22.527 STDOUT terraform:       ~ addon_version               = "v1.11.3-eksbuild.1" -> "v1.11.4-eksbuild.2"
14:54:22.527 STDOUT terraform:         id                          = "notification-canada-ca-production-eks-cluster:coredns"
14:54:22.527 STDOUT terraform:         tags                        = {}
14:54:22.527 STDOUT terraform:         # (11 unchanged attributes hidden)
14:54:22.527 STDOUT terraform:     }
14:54:22.527 STDOUT terraform:   # aws_eks_addon.ebs_driver will be updated in-place
14:54:22.527 STDOUT terraform:   ~ resource "aws_eks_addon" "ebs_driver" {
14:54:22.527 STDOUT terraform:       ~ addon_version               = "v1.35.0-eksbuild.1" -> "v1.42.0-eksbuild.1"
14:54:22.527 STDOUT terraform:         id                          = "notification-canada-ca-production-eks-cluster:aws-ebs-csi-driver"
14:54:22.527 STDOUT terraform:         tags                        = {}
14:54:22.527 STDOUT terraform:         # (10 unchanged attributes hidden)
14:54:22.527 STDOUT terraform:     }
14:54:22.527 STDOUT terraform:   # aws_eks_addon.kube_proxy will be updated in-place
14:54:22.527 STDOUT terraform:   ~ resource "aws_eks_addon" "kube_proxy" {
14:54:22.527 STDOUT terraform:       ~ addon_version               = "v1.31.0-eksbuild.5" -> "v1.32.0-eksbuild.2"
14:54:22.527 STDOUT terraform:         id                          = "notification-canada-ca-production-eks-cluster:kube-proxy"
14:54:22.527 STDOUT terraform:         tags                        = {}
14:54:22.528 STDOUT terraform:         # (11 unchanged attributes hidden)
14:54:22.528 STDOUT terraform:     }
14:54:22.528 STDOUT terraform:   # aws_eks_addon.vpc_cni will be updated in-place
14:54:22.528 STDOUT terraform:   ~ resource "aws_eks_addon" "vpc_cni" {
14:54:22.528 STDOUT terraform:       ~ addon_version               = "v1.18.5-eksbuild.1" -> "v1.19.2-eksbuild.5"
14:54:22.528 STDOUT terraform:         id                          = "notification-canada-ca-production-eks-cluster:vpc-cni"
14:54:22.528 STDOUT terraform:         tags                        = {}
14:54:22.528 STDOUT terraform:         # (11 unchanged attributes hidden)
14:54:22.528 STDOUT terraform:     }
14:54:22.528 STDOUT terraform:   # aws_eks_cluster.notification-canada-ca-eks-cluster will be updated in-place
14:54:22.528 STDOUT terraform:   ~ resource "aws_eks_cluster" "notification-canada-ca-eks-cluster" {
14:54:22.530 STDOUT terraform:         id                            = "notification-canada-ca-production-eks-cluster"
14:54:22.531 STDOUT terraform:         name                          = "notification-canada-ca-production-eks-cluster"
14:54:22.531 STDOUT terraform:         tags                          = {
14:54:22.531 STDOUT terraform:             "CostCenter" = "notification-canada-ca-production"
14:54:22.531 STDOUT terraform:             "Name"       = "notification-canada-ca"
14:54:22.531 STDOUT terraform:         }
14:54:22.531 STDOUT terraform:       ~ version                       = "1.31" -> "1.32"
14:54:22.531 STDOUT terraform:         # (11 unchanged attributes hidden)
14:54:22.531 STDOUT terraform:         # (4 unchanged blocks hidden)
14:54:22.531 STDOUT terraform:     }
14:54:22.531 STDOUT terraform:   # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
14:54:22.531 STDOUT terraform:   ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
14:54:22.531 STDOUT terraform:         id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
14:54:22.531 STDOUT terraform:       ~ release_version        = "1.31.5-20250317" -> "1.32.1-20250419"
14:54:22.531 STDOUT terraform:         tags                   = {
14:54:22.531 STDOUT terraform:             "CostCenter"             = "notification-canada-ca-production"
14:54:22.531 STDOUT terraform:             "Name"                   = "notification-canada-ca"
14:54:22.531 STDOUT terraform:             "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
14:54:22.532 STDOUT terraform:         }
14:54:22.532 STDOUT terraform:         # (16 unchanged attributes hidden)
14:54:22.532 STDOUT terraform:         # (3 unchanged blocks hidden)
14:54:22.532 STDOUT terraform:     }
14:54:22.532 STDOUT terraform:   # aws_iam_openid_connect_provider.notification-canada-ca will be updated in-place
14:54:22.532 STDOUT terraform:   ~ resource "aws_iam_openid_connect_provider" "notification-canada-ca" {
14:54:22.532 STDOUT terraform:         id              = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
14:54:22.532 STDOUT terraform:         tags            = {}
14:54:22.532 STDOUT terraform:       ~ thumbprint_list = [
14:54:22.532 STDOUT terraform:           - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
14:54:22.532 STDOUT terraform:         ] -> (known after apply)
14:54:22.532 STDOUT terraform:         # (4 unchanged attributes hidden)
14:54:22.532 STDOUT terraform:     }
14:54:22.532 STDOUT terraform:   # aws_iam_role.admin will be updated in-place
14:54:22.532 STDOUT terraform:   ~ resource "aws_iam_role" "admin" {
14:54:22.532 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
14:54:22.535 STDOUT terraform:             {
14:54:22.535 STDOUT terraform:               - Statement = [
14:54:22.535 STDOUT terraform:                   - {
14:54:22.535 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
14:54:22.536 STDOUT terraform:                       - Condition = {
14:54:22.536 STDOUT terraform:                           - StringEquals = {
14:54:22.536 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
14:54:22.536 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-admin"
14:54:22.536 STDOUT terraform:                             }
14:54:22.536 STDOUT terraform:                         }
14:54:22.536 STDOUT terraform:                       - Effect    = "Allow"
14:54:22.536 STDOUT terraform:                       - Principal = {
14:54:22.536 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
14:54:22.536 STDOUT terraform:                         }
14:54:22.536 STDOUT terraform:                     },
14:54:22.536 STDOUT terraform:                 ]
14:54:22.536 STDOUT terraform:               - Version   = "2012-10-17"
14:54:22.536 STDOUT terraform:             }
14:54:22.536 STDOUT terraform:         ) -> (known after apply)
14:54:22.536 STDOUT terraform:         id                    = "admin-eks-role"
14:54:22.536 STDOUT terraform:         name                  = "admin-eks-role"
14:54:22.536 STDOUT terraform:         tags                  = {}
14:54:22.536 STDOUT terraform:         # (11 unchanged attributes hidden)
14:54:22.536 STDOUT terraform:     }
14:54:22.536 STDOUT terraform:   # aws_iam_role.api will be updated in-place
14:54:22.536 STDOUT terraform:   ~ resource "aws_iam_role" "api" {
14:54:22.536 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
14:54:22.536 STDOUT terraform:             {
14:54:22.536 STDOUT terraform:               - Statement = [
14:54:22.536 STDOUT terraform:                   - {
14:54:22.536 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
14:54:22.537 STDOUT terraform:                       - Condition = {
14:54:22.537 STDOUT terraform:                           - StringEquals = {
14:54:22.537 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
14:54:22.537 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-api"
14:54:22.537 STDOUT terraform:                             }
14:54:22.537 STDOUT terraform:                         }
14:54:22.537 STDOUT terraform:                       - Effect    = "Allow"
14:54:22.537 STDOUT terraform:                       - Principal = {
14:54:22.537 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
14:54:22.537 STDOUT terraform:                         }
14:54:22.537 STDOUT terraform:                     },
14:54:22.537 STDOUT terraform:                 ]
14:54:22.537 STDOUT terraform:               - Version   = "2012-10-17"
14:54:22.537 STDOUT terraform:             }
14:54:22.537 STDOUT terraform:         ) -> (known after apply)
14:54:22.537 STDOUT terraform:         id                    = "api-eks-role"
14:54:22.537 STDOUT terraform:         name                  = "api-eks-role"
14:54:22.537 STDOUT terraform:         tags                  = {}
14:54:22.537 STDOUT terraform:         # (11 unchanged attributes hidden)
14:54:22.537 STDOUT terraform:     }
14:54:22.537 STDOUT terraform:   # aws_iam_role.celery will be updated in-place
14:54:22.538 STDOUT terraform:   ~ resource "aws_iam_role" "celery" {
14:54:22.538 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
14:54:22.538 STDOUT terraform:             {
14:54:22.538 STDOUT terraform:               - Statement = [
14:54:22.538 STDOUT terraform:                   -...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.oom-errors[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
